Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмирения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмирения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеНаЭтикетке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальнаПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УКТЗЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтрихКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШтрихКода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыШтрихКодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Номенклатура/Ext/ManagerModule.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытий
// Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции


Функция ПреобразоватьТоварВМассив(Товар)

	Массив = Новый Массив;
	Массив.Добавить(Товар);
	
	Возврат Массив;

КонецФункции // ПреобразоватьТоварВМассив()

Функция ПолучитьЦенуТовара(МассивТоваров, Дата = Неопределено) Экспорт 
	//ЦеныТоваров = Новый Соответствие; 

	//Если НЕ ТипЗнч(МассивТоваров) = Тип("Массив") Тогда
	//	
	//	Если ТипЗнч(МассивТоваров) = Тип("СправочникСсылка.Номенклатура") Тогда
	//		МассивТоваров = ПреобразоватьТоварВМассив(МассивТоваров);
	//	Иначе
	//		Сообщить("Переданный тип не соответствует массиву");
	//		Возврат ЦеныТоваров;	
	//	КонецЕсли
	//		
	//КонецЕсли;

	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
	//	|	ЦеныСрезПоследних.Цена КАК Цена
	//	|ИЗ
	//	|	РегистрСведений.Цены.СрезПоследних КАК ЦеныСрезПоследних
	//	|ГДЕ
	//	|	ЦеныСрезПоследних.Номенклатура В(&Номенклатура)";
	//
	//Запрос.УстановитьПараметр("Номенклатура", МассивТоваров);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Выборка = РезультатЗапроса.Выбрать();

	//Пока Выборка.Следующий() Цикл
	//	ЦеныТоваров.Вставить(Выборка.Номенклатура, Выборка.Цена);		
	//КонецЦикла;
	//
	//   Возврат ЦеныТоваров;
	
	Если НЕ ТипЗнч(МассивТоваров) = Тип("СправочникСсылка.Номенклатура") Тогда
		Сообщить("Переданный тип не соответствует массиву");
		Возврат 0;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", МассивТоваров);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.Цена;	
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции // ПолучитьЦенуТовара()

Функция НайтиНоменклатуруПоШтрихКоду(ШтрихКод) Экспорт 
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(ШтрихКод, "Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураШтрихКоды.Ссылка.Ссылка КАК Ссылка,
		|	НоменклатураШтрихКоды.ШтрихКод КАК ШтрихКод
		|ИЗ
		|	Справочник.Номенклатура.ШтрихКоды КАК НоменклатураШтрихКоды
		|ГДЕ
		|	НоменклатураШтрихКоды.ШтрихКод = &ШтрихКод";
	
	Запрос.УстановитьПараметр("ШтрихКод", Формат(ШтрихКод, "ЧРГ=' '; ЧГ=0"));	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий(); 
	
	Возврат Выборка.Ссылка;

КонецФункции 

Функция НайтиНоменклатуруПоКоду(Код) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	
	//Возврат Справочники.Номенклатура.НайтиПоКоду(Строка(Код), Истина);	

КонецФункции // НайтиПоКоду()

Функция НайтиНоменклатуруПоНазванию(Название) Экспорт

	Возврат Справочники.Номенклатура.НайтиПоНаименованию(Название);	

КонецФункции // НайтиПоКоду()

Функция ПолучитьПроцентНаценки(Номенклатура) Экспорт 

    Возврат Номенклатура.Родитель.ПроцентНаценки;
	
КонецФункции 

&НаСервере
Функция  ГлобальныйПоискПоШтрихКоду(ШтрихКод) Экспорт 
	
	Номенклатура = НайтиНоменклатуруПоШтрихКоду(ШтрихКод);
	
	Если Номенклатура = Неопределено Тогда
		
		Номенклатура = НайтиНоменклатуруПоКоду(ШтрихКод);
		//товар не обнаружен
		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли;  
	
	Возврат Номенклатура;

КонецФункции // ОбработкаВводаШтрихКода()

Функция ШтрихкодНоменклатуры(Номенклатура) Экспорт 
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Номенклатура, "СправочникСсылка.Номенклатура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураШтрихКоды.Ссылка.Ссылка КАК Ссылка,
		|	НоменклатураШтрихКоды.ШтрихКод КАК ШтрихКод
		|ИЗ
		|	Справочник.Номенклатура.ШтрихКоды КАК НоменклатураШтрихКоды
		|ГДЕ
		|	НоменклатураШтрихКоды.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ШтрихКод;
	КонецЦикла;
	
	Возврат Номенклатура.Код;
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
КонецФункции
#КонецОбласти

#Область Инициализация

#КонецОбласти
